Revit 2024 API
CustomInitialColor Constructor (CustomInitialColor)
 Creates a copy of the given custom initial color
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public CustomInitialColor(
	CustomInitialColor other
)
Visual Basic
Public Sub New ( _
	other As CustomInitialColor _
)
Visual C++
public:
CustomInitialColor(
	CustomInitialColor^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Lighting.CustomInitialColor
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
CustomInitialColor Class
CustomInitialColor Overload
Autodesk.Revit.DB.Lighting Namespace